//query DeviceEvents table for all occurrences of failed system guard boot integrity validations
//shows all events for systems whose Windows 10 boot process has been tampered with and therefore measured boot validation fails
//jesse.esquivel@microsoft.com
DeviceEvents //DeviceEvents
| where ActionType == 'DeviceBootAttestationInfo'
| extend SG = parsejson(AdditionalFields) 
| extend SystemGuardSecurityLevel = SG.SystemGuardSecurityLevel
| extend ValidationResult = SG.ValidationResult
| extend ReportValidityStartTime = SG.ReportValidityStartTime 
| extend ReportExpirationTime = SG.ReportExpirationTime
| extend ValidationErrorMessage = SG.ValidationErrorMessage
| where ValidationResult != 'Success'
| project Timestamp, DeviceName, DeviceId, SystemGuardSecurityLevel, ValidationResult, ValidationErrorMessage, ReportValidityStartTime, ReportExpirationTime, ReportId
