//query DeviceEvents table for all occurrences of ASR audit events
//Use this data to assess impact of ASR rules, and possibly make exceptions for known/trusted binaries
//jesse.esquivel@microsoft.com
//All audited events for Exploit Guard stack
DeviceEvents
 | where ActionType startswith "ASR"
 | where ActionType contains "Audited"
 | extend RuleGuid = tolower(tostring(parsejson(AdditionalFields).RuleId))
 | summarize DevicesImpacted=dcount(DeviceName) by InitiatingProcessFolderPath, InitiatingProcessFileName, InitiatingProcessCommandLine, ActionType, RuleGuid
 | project DevicesImpacted, InitiatingProcessFolderPath, InitiatingProcessFileName, InitiatingProcessCommandLine, ActionType, RuleGuid 
