//query machine count by version
//jesse.esquivel@microsoft.com
DeviceInfo
| summarize machineCount=dcount(DeviceName) by ClientVersion
| order by machineCount desc 
| project machineCount, ClientVersion
