//parse that pesky JSON contained within brackets
//jesse.esquivel@microsoft.com
DeviceNetworkInfo
| where NetworkAdapterStatus == "Up"
| extend data=parsejson(ConnectedNetworks)
| mv-expand data
| project data.Name, data.Description, data.IsConnectedToInternet, data.Category
