//query Deviceinfo table for all loggedon users and then finds occurrences of usb storage plug and play DeviceAlertEvents
//and joins both tables so output shows both USB events and loggedon user
//jesse.esquivel@microsoft.com
let loggedOnUsers = DeviceInfo
    | extend data=parsejson(LoggedOnUsers)
    | mv-expand data
    | extend userName = data.UserName
    | project userName, DeviceId, Timestamp;
DeviceEvents
| where ActionType == 'PnpDeviceConnected'
| extend PNP = parsejson(AdditionalFields) 
| extend ClassName = PNP.ClassName 
| extend PnPDeviceId = PNP.DeviceId 
| extend DeviceDescription = PNP.DeviceDescription
| extend VendorId = split(PNP.VendorIds,@'\r\n\t\t')
| extend VendorId = PNP.VendorIds
| where PnPDeviceId startswith @'USBSTOR\'
| project Timestamp, DeviceName, DeviceId, ClassName, DeviceDescription, PnPDeviceId, VendorId, ReportId
| join kind = inner(loggedOnUsers) on DeviceId
| summarize arg_max(Timestamp1, *) by Timestamp
| project-away DeviceId1, Timestamp1 
| sort by Timestamp desc
